Public Attributes | List of all members
ACAPI::MEP::Orientation Struct Reference
MEP Element Manager
Defines the orientation with the help of a direction and rotation vector. More...
#include <MEPTypes.hpp>
 Public Attributes
 API_Vector3D  | direction
Direction of the Orientation.
 API_Vector3D  | rotation
Rotation of the Orientation.
Detailed Description
Defines the orientation with the help of a direction and rotation vector.